/* SPDX-License-Identifier: AGPL-3.0-only */
/* SPDX-FileCopyrightText: 2025-2026 Yurii Arkhanhelskyi */
/* Описания доступа, которые ПОКАЗЫВАЕТ СИСТЕМА.
   Не переводы интерфейса: эти строки читает macOS в своём окне запроса,
   и язык там — системный, а не выбранный в настройках приложения.
   Правится вместе с macos/Runner/Info.plist: ключ, которого нет здесь,
   система покажет на языке разработки. */

"NSMicrophoneUsageDescription" = "Secretly usa el micrófono para llamadas de voz y vídeo, y para grabar mensajes de voz.";
"NSCameraUsageDescription" = "Secretly usa la cámara para videollamadas y para escanear códigos QR de vinculación de dispositivos.";
"NSPhotoLibraryUsageDescription" = "Secretly accede a tus fotos para enviar imágenes en los chats.";
"NSDocumentsFolderUsageDescription" = "Secretly accede a tu carpeta Documentos para enviar archivos en los chats.";
"NSDownloadsFolderUsageDescription" = "Secretly accede a tu carpeta Descargas para guardar archivos de los chats.";
"NSDesktopFolderUsageDescription" = "Secretly accede a tu Escritorio para enviar archivos y capturas de pantalla.";
"NSAppleEventsUsageDescription" = "Secretly usa Apple Events para integrarse con las notificaciones del sistema.";
